print("Доступные функции калькулятор: Сумма, Разница, Умножение, Деление, Степень, Целочисленное деление, Остаток.")
num1 = int(input("Введите первое число: "))
action = input("Введите желаемое действие: ")
if action == "Сумма":
    print("Результат равен: ", (num1 + int(input("Введите второе число: "))))
elif action == "Разница":
    print("Результат равен: ", (num1 - int(input("Введите второе число: "))))
elif action == "Умножение":
    print("Результат равен: ", (num1 * int(input("Введите второе число: "))))
elif action == "Деление":
    print("Результат равен: ", (num1 / int(input("Введите второе число: "))))
elif action == "Степень":
    print("Результат равен: ", (num1 ** int(input("Введите второе число: "))))
elif action == "Целочисленное деление":
    print("Результат равен: ", (num1 // int(input("Введите второе число: "))))
elif action == "Остаток":
    print("Результат равен: ", (num1 % int(input("Введите второе число: "))))
else:
    print("Калькулятор не понимает ваше пожелание, попробуйте снова")